
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.api.azurerm_api_management_api.api
  * module.api.azurerm_api_management_product_api.link_to_product[0]
  * module.em-icp-api.azurerm_api_management_product.product
  * module.policy.azurerm_api_management_api_policy.api_policy
* Delete
  * azurerm_web_pubsub_hub.icpHub


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_web_pubsub_hub.icpHub will be destroyed
  # (because azurerm_web_pubsub_hub.icpHub is not in configuration)
  - resource "azurerm_web_pubsub_hub" "icpHub" {
      - anonymous_connections_enabled = true -> null
      - id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-icp-prod/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-prod/hubs/icpHub" -> null
      - name                          = "icpHub" -> null
      - web_pubsub_id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-icp-prod/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-prod" -> null

      - event_handler {
          - system_events      = [
              - "connect",
              - "connected",
              - "disconnected",
            ] -> null
          - url_template       = "https://em-icp.prod.platform.hmcts.net/eventhandler" -> null
          - user_event_pattern = "*" -> null
        }
    }

  # module.api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "em-icp"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "em-icp-api"
      + path                  = "em-icp-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "core-infra-prod"
      + revision              = "1"
      + service_url           = "http://em-icp-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/em-icp.json"
        }
    }

  # module.api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-prod"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + product_id          = "em-icp-api"
      + resource_group_name = "core-infra-prod"
    }

  # module.em-icp-api.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-prod"
      + approval_required     = true
      + display_name          = "em-icp-api"
      + id                    = (known after apply)
      + product_id            = "em-icp-api"
      + published             = true
      + resource_group_name   = "core-infra-prod"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-prod"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-prod"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null)" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Missing client certificate</set-body>
                            </return-response>
                        </when>
                        <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;8A13CF9CC991EDE7A2A227E4153A54F6E3157774&quot;,&quot;29390B7A235C692DACD93FA0AB90081867177BEC&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Invalid client certificate</set-body>
                            </return-response>
                        </when>
                    </choose>
                    <rate-limit-by-key calls="3" renewal-period="15" counter-key="@(context.Subscription.Id)" />
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1210,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->